import React from "react";
import "./SinglePodCast.css";
import { CgCalendarDates } from "react-icons/cg";
import { LuEye } from "react-icons/lu";
import { BiCategory } from "react-icons/bi";
import header_img from "../../assets/Rectangle 50.png"
import descr_imgA from "../../assets/Rectangle 62.png"
import descr_imgB from "../../assets/Rectangle 63.png"
const SinglePodCast = () => {
  const podcast = {
    header_imgurl: header_img,
    descr_imgurl_a: descr_imgA,
    descr_imgurl_b: descr_imgB,
    title: "التحالفات الاستراتيجية: القادة السياسيون وتوازن القوى",
    descr:
      "لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد.لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد.لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد.",
    sub_descr:
      "لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد.لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.",
    last_descr:
      "لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد. لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.لوريم إيبسوم هو ببساطة نص وهمي من صناعة الطباعة والتنضيد.لقد كان لوريم إيبسوم هو النص الوهمي القياسي في هذه الصناعة منذ القرن السادس عشر، عندما أخذت طابعة غير معروفة لوح الكتابة وخلطته لصنع نموذج كتاب.",
    video_url: "",
    date : "14 أبريل 2024",
    views : "11,900",
    category : "سياسة"
  };
  return (
    <div className="single-podcast">
      <div class="card">
        <img src={podcast.header_imgurl} class="podcast-img" alt="..." />
        <div class="card-body">
            <div className="podcast-info">
                
                <p class="date">
                  {podcast.date}
                  <span className="calender-icon">
                    <CgCalendarDates />
                  </span>
                </p>
                <p class="date">
                  {podcast.views}
                  <span className="calender-icon">
                    <LuEye />
                  </span>
                </p>
                
                <p class="date">
                  {podcast.category}
                  <span className="calender-icon">
                    <BiCategory />
                  </span>
                </p>
                
            </div>
          <h5 class="title">{podcast.title}</h5>
          <p class="descr">{podcast.descr}</p>
          <p class="sub-descr">{podcast.sub_descr}</p>
          <div className="row gy-3 gx-3">
            <div className="col-md-6">
                <img className="descr-img" src={podcast.descr_imgurl_a}/>
            </div>
            <div className="col-md-6">
                <img className="descr-img" src={podcast.descr_imgurl_b}/>
            </div>
          </div>
          <p class="last-descr">{podcast.last_descr}</p>
        </div>
      </div>
    </div>
  );
};

export default SinglePodCast;
